In [4]:
#lets import rquired library

In [34]:
import math
import pandas as pd

In [11]:
#lets define function for gini
def gini(samples):
    sum_samples=sum(samples)
    gini_score=0
    probablities=[]
    for sample in samples:
        probablity=(sample/sum_samples)
        probablities.append(probablity)
    for probablity in probablities:
        gini_score+=probablity*(1-probablity)
    return gini_score

In [12]:
#lets test sample of impure data
samples=[56,76,14]
print(gini(samples))

0.5727153312066053

In [27]:
#lets test sample of pure
samples2=[0,0,78]
print(gini(samples2))

0.0

In [30]:
#lets define functin for entropy
def entropy(samples):
    sum_samples=sum(samples)
    entropy=0
    probablities=[]
    for sample in samples:
        probablity=sample/sum_samples
        probablities.append(probablity)
    for probablity in probablities:
        if probablity>0:
            entropy+=probablity*math.log(probablity)
    return entropy*-1

# we use if for probablity greater then 0

In [31]:
print(entropy(samples))

0.9322214767936574

In [33]:
#lets test sample of pure
samples2=[0,0,78]
print(entropy(samples2))

-0.0

In [35]:
#lets load data
df=pd.read_csv('StudentsPerformance.csv')
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [36]:
#lets explore the data
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [37]:
df.info

<bound method DataFrame.info of      gender race/ethnicity parental level of education         lunch  \
0    female        group B           bachelor's degree      standard
1    female        group C                some college      standard
2    female        group B             master's degree      standard
3      male        group A          associate's degree  free/reduced
4      male        group C                some college      standard
..      ...            ...                         ...           ...
995  female        group E             master's degree      standard
996    male        group C                 high school  free/reduced
997  female        group C                 high school  free/reduced
998  female        group D                some college      standard
999  female        group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
1                 completed          69             90             88
2                      none          90             95             93
3                      none          47             57             44
4                      none          76             78             75
..                      ...         ...            ...            ...
995               completed          88             99             95
996                    none          62             55             55
997               completed          59             71             65
998               completed          68             78             77
999                    none          77             86             86

[1000 rows x 8 columns]>

In [38]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [ ]:
df['parental level of education']=df['parental level of education'].replace(['some college','associate\'s degree','high school','high school','bachelor\'s degree','master\'s degree'],[1,2,3,4,5,6])

In [51]:
df1['parental level of education'].value_counts()

1                   226
2                   222
4                   196
some high school    179
5                   118
6                    59
Name: parental level of education, dtype: int64

In [52]:
df.gender=df.gender.replace(['male','female'],[0,1])

In [53]:
df['test preparation course'].value_counts()

none         642
completed    358
Name: test preparation course, dtype: int64

In [54]:
df['test preparation course']=df['test preparation course'].replace(['none','completed'],[0,1])

In [56]:
df1=df[['gender','parental level of education','test preparation course','math score','reading score','writing score']]
df1.head()

,gender,parental level of education,test preparation course,math score,reading score,writing score
0,1,5,0,72,72,74
1,1,1,1,69,90,88
2,1,6,0,90,95,93
3,0,2,0,47,57,44
4,0,1,0,76,78,75

In [59]:
# find the class of all the scores
df1['math score'].value_counts()

65    36
62    35
69    32
59    32
61    27
      ..
24     1
26     1
28     1
33     1
0      1
Name: math score, Length: 81, dtype: int64

In [62]:
df2=df1.drop(['reading score','writing score'],axis=1)

In [63]:
df2

     gender parental level of education  test preparation course  math score
0         1                           5                        0          72
1         1                           1                        1          69
2         1                           6                        0          90
3         0                           2                        0          47
4         0                           1                        0          76
..      ...                         ...                      ...         ...
995       1                           6                        1          88
996       0                           4                        0          62
997       1                           4                        1          59
998       1                           1                        1          68
999       1                           1                        0          77

[1000 rows x 4 columns]

In [69]:
df2['math score']=df2['math score'].replace([[df2['math score']<50]=='0',[df2['math score']>50]=='1'])

In [71]:
def conv(row):
    if row['math score']<50:
        return 1
    else:
        return 0

In [72]:
df2['status']=df2.apply(lambda row:conv(row),axis=1)

In [74]:
df2.drop(columns='math score')

     gender parental level of education  test preparation course  status
0         1                           5                        0       0
1         1                           1                        1       0
2         1                           6                        0       0
3         0                           2                        0       1
4         0                           1                        0       0
..      ...                         ...                      ...     ...
995       1                           6                        1       0
996       0                           4                        0       0
997       1                           4                        1       0
998       1                           1                        1       0
999       1                           1                        0       0

[1000 rows x 4 columns]

In [75]:
df2.status.value_counts()

0    866
1    134
Name: status, dtype: int64

In [77]:
gini([866,134])

0.23208800000000002

In [ ]:
df2.